## Feature Engineering:Outlier detection and removal using IQR.

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("height_name.csv")

In [4]:
df

       name  height
0   santosh     5.9
1      Anil     5.2
2      Ravi     5.1
3    Pravin     5.5
4     virat     4.9
5     kunal     5.4
6      Abhi     6.2
7     Kirti     6.5
8      dipa     7.1
9      devi    14.5
10     hemi     6.1
11     rutu     5.6
12   vishal     1.2
13     arti     5.5

In [5]:
df.shape

(14, 2)

In [6]:
df.describe()

          height
count  14.000000
mean    6.050000
std     2.779804
min     1.200000
25%     5.250000
50%     5.550000
75%     6.175000
max    14.500000

In [7]:
Q1 = df.height.quantile(0.25)
Q3 = df.height.quantile(0.75)
Q1, Q3

(5.25, 6.175)

In [8]:
IQR = Q3 - Q1
IQR

0.9249999999999998

In [9]:
lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR
lower_limit, upper_limit

(3.8625000000000003, 7.5625)

In [10]:
df[(df.height < lower_limit) | (df.height > upper_limit)]

      name  height
9     devi    14.5
12  vishal     1.2

## Remove Outliers

In [11]:
df_no_outlier = df[(df.height > lower_limit) & (df.height < upper_limit)]
df_no_outlier

       name  height
0   santosh     5.9
1      Anil     5.2
2      Ravi     5.1
3    Pravin     5.5
4     virat     4.9
5     kunal     5.4
6      Abhi     6.2
7     Kirti     6.5
8      dipa     7.1
10     hemi     6.1
11     rutu     5.6
13     arti     5.5